
# 接口基础  HTTP协议     Interface

# USB ==> 1

# 3.5耳机口 ==》 1   相同的功能。  适配，桥梁，中介 ==》 不同的系统。本来他们无法进行沟通，
# 有了接口以后，他们就能沟通了。

# www.baidu.com  ==>  api.github.com  1  2  URI ==> web api

# 函数 ====》 1 2 0    3    #面试题： APIs  ==> 全程  应用程序可编程接口

# UI  ==>   1,2  ==》 user interface  ==>

def add(a, b):
    return a + b


add(4, 5)   # 私有函数  共有函数


# HTTP  ==> 邮政系统，发快递
# 域名 IP
# 发快递。退货，， 快递单。 地址  ==》  邮编：

# DNS

# TCP/IP

# 服务端/ 后端，   处理请求/被动
# 客户端，前端     浏览器，手机app, 硬件，    发送请求/主动


# 退件进行操作。
# 1. 填单， 2. 包裹 3. 顺丰，申通 《玩命快递》

# 1. 收货地址
# 2. get, post, delete, head, patch, options,方法。==》 快递
#  header, 请求头。  说明信息。地址，方法，衣服，鞋子，价值，==》 快递单
# user-agent  篡改消息头 ==》 爬虫

# 面试题：1 http/ tcp/ip: 三次握手，四次挥手。
# 面试题：2 get/ post 请求

# 一封信：你到家了吗? 你最近过的怎么样  请求体

# get 请求可以包含请求参数。

# 请求体 包裹


# cookie ！= 缓存
# 会员机制。
# HTTP 无状态。记性不好，记不住事。
# 淘宝，==》 cookie,

# 会员机制。会员卡号。 5折，=原价

# cookie, 1， 请求一个网址，==》 派发一个会员卡 cookie
# 保存。浏览器会自动保存 cookie ==> 目标网站，cookie值，cookie类型。超市，理发
# 2. 请求目标，自动带上 cookie


# 响应
"""
吾兄灰灰的：见字如面。。。。。


李云龙：老赵啊， 上次在你家里喝的那点五粮液，太少啦！你啥时候这么抠。
这样六，我老李再到你们家去一趟，你记得提前准备 10 斤小龙虾。

请求发送。

发送回信：小龙虾已经备好。

我这信发没发出去啊？ 快递弄丢了，不想回信？ 还是这个快递自己收了。

HTTP: 都会发送一个回信给请求方。 信息，响应body主体。

TODO: 都有可能被出面试：：状态码：200.   拿到快递，10000，装车了，10001，中转，10002

新地址：服务器返回，： location: 新地址


经典面试题： cookie, session,和 token 的区别
cookie 浏览器保存在本地的信息；
session 服务器处理的信息；
token  令牌，口令，==》 1. 随时带在身上。 2. 动态的。 3. 跨平台的，




这是作业！！！！

"""























